sterentev/atdf-device-asm-include/inc/ATtiny4313.inc
; ----------	Register SPMCSR bits		------------------------
.equ	CTPB		= 4		; 0x10 - Clear Temporary Page Buffer
.equ	RFLB		= 3		; 0x08 - Read Fuse and Lock Bits
.equ	PGWRT		= 2		; 0x04 - Page Write
.equ	PGERS		= 1		; 0x02 - Page Erase
.equ	SPMEN		= 0		; 0x01 - Store Program Memory Enable

; ----------	Register MCUCR bits		------------------------
.equ	PUD		= 7		; 0x80 - Pull-up Disable
.equ	SM_MASK		= 0x50		;      - Sleep Mode Select Bits (2 bits)
.equ	SE		= 5		; 0x20 - Sleep Enable
.equ	ISC1_MASK	= 0x0C		;      - Interrupt Sense Control 1 bits (2 bits)
.equ	ISC10		= 2		;          ISC1 BIT0 position
.equ	ISC0_MASK	= 0x03		;      - Interrupt Sense Control 0 bits (2 bits)
.equ	ISC00		= 0		;          ISC0 BIT0 position
; ::::  SM	:::: bitfield values
;			0x00		; Idle
;			0x10		; Power Down
;			0x00		; Standby
;			0x10		; Power Down 
; ::::  ISC1	:::: bitfield values
;			0x00		; Low Level of INTX
;			0x04		; Any Logical Change in INTX
;			0x08		; Falling Edge of INTX
;			0x0C		; Rising Edge of INTX
; ::::  ISC0	:::: bitfield values
;			0x00		; Low Level of INTX
;			0x01		; Any Logical Change in INTX
;			0x02		; Falling Edge of INTX
;			0x03		; Rising Edge of INTX

; ----------	Register MCUSR bits		------------------------
.equ	WDRF		= 3		; 0x08 - Watchdog Reset Flag
.equ	BORF		= 2		; 0x04 - Brown-out Reset Flag
.equ	EXTRF		= 1		; 0x02 - External Reset Flag
.equ	PORF		= 0		; 0x01 - Power-On Reset Flag

; ----------	Register OSCCAL bits		------------------------
.equ	OSCCAL_MASK	= 0xFF		;      - Oscillator Calibration (8 bits)
.equ	OSCCAL0		= 0		;          OSCCAL BIT0 position

; ----------	Register CLKPR bits		------------------------
.equ	CLKPCE		= 7		; 0x80 - Clock Prescaler Change Enable
.equ	CLKPS_MASK	= 0x0F		;      - Clock Prescaler Select Bits (4 bits)
.equ	CLKPS0		= 0		;          CLKPS BIT0 position
; ::::  CLKPS	:::: bitfield values
;			0x00		; 1
;			0x01		; 2
;			0x02		; 4
;			0x03		; 8
;			0x04		; 16
;			0x05		; 32
;			0x06		; 64
;			0x07		; 128
;			0x08		; 256

; ----------	Register GTCCR bits		------------------------
.equ	PSR10		= 0		; 0x01 - 

; ----------	Register PRR bits		------------------------
.equ	PRTIM_MASK	= 0x0C		;      -  (2 bits)
.equ	PRTIM0		= 2		;          PRTIM BIT0 position
.equ	PRUSI		= 1		; 0x02 - 
.equ	PRUSART		= 0		; 0x01 - 

; ----------	Register BODCR bits		------------------------
.equ	BPDS		= 1		; 0x02 - 
.equ	BPDSE		= 0		; 0x01 - 




; **********************************************************************
; ***************	INTERRUPT VECTORS	************************
; **********************************************************************
;
.equ	INT_VECTORS_NUM		= 21
.equ	INT_VECTORS_SIZE	= 0x2A
;
; ----------	INTERRUPT INDEXES		------------------------
;
;	0	RESET		; External Reset, Power-on Reset and Watchdog Reset
;	1	INT0		; External Interrupt Request 0
;	2	INT1		; External Interrupt Request 1
;	3	TIMER1_CAPT	; Timer/Counter1 Capture Event
;	4	TIMER1_COMPA	; Timer/Counter1 Compare Match A
;	5	TIMER1_OVF	; Timer/Counter1 Overflow
;	6	TIMER0_OVF	; Timer/Counter0 Overflow
;	7	USART_RX	; USART, Rx Complete
;	8	USART_UDRE	; USART Data Register Empty
;	9	USART_TX	; USART, Tx Complete
;	10	ANA_COMP	; Analog Comparator
;	11	PCINT_B		; Pin Change Interrupt Request B
;	12	TIMER1_COMPB
;	13	TIMER0_COMPA
;	14	TIMER0_COMPB
;	15	USI_START	; USI Start Condition
;	16	USI_OVERFLOW	; USI Overflow
;	17	EEPROM_Ready
;	18	WDT_OVERFLOW	; Watchdog Timer Overflow
;	19	PCINT_A		; Pin Change Interrupt Request A
;	20	PCINT_D		; Pin Change Interrupt Request D



; **********************************************************************
; ***************	ASM PROGRAM SKELETON	************************
; **********************************************************************
;
;  Copy-paste following definitions into your code,
;  uncomment and modify for your needs
;
; ----------	 >>>   SKELETON BEGIN   <<<	------------------------
;#	.include "ATtiny4313.inc"
;#	
;#	; FUSES EXTENDED byte (addr 0x02)
;#	.set	FUSES_EXTENDED	= 0xFF \
;#				  & ~(0 <<SELFPRGEN)
;#	; FUSES HIGH byte (addr 0x01)
;#	.set	BODLEVEL	= 0x0E	; Brown-out detection disabled
;#	.set	FUSES_HIGH	= 0xFF \
;#				  & ~(0 <<DWEN) \
;#				  & ~(0 <<EESAVE) \
;#				  & ~(1 <<SPIEN) \
;#				  & ~(0 <<WDTON) \
;#				  &  (~BODLEVEL_MASK | BODLEVEL) \
;#				  & ~(0 <<RSTDISBL)
;#	; FUSES LOW byte (addr 0x00)
;#	.set	SUT_CKSEL	= 0x22	; Int. RC Osc. 4 MHz; Start-up time: 14 CK + 65  ms
;#	.set	FUSES_LOW	= 0xFF \
;#				  & ~(1 <<CKDIV8) \
;#				  & ~(0 <<CKOUT) \
;#				  &  (~SUT_CKSEL_MASK | SUT_CKSEL)
;#	; LOCKBITS LOCKBIT byte (addr 0x00)
;#	.set	LB		= 0x03	; No memory lock features enabled
;#	.set	LOCKBITS_LOCKBIT= 0xFF \
;#				  &  (~LB_MASK | LB)
;#	.message "====================="
;#	.message "=====  Fuses  ======="
;#	.message "EXTENDED	", FUSES_EXTENDED
;#	.message "HIGH		", FUSES_HIGH
;#	.message "LOW		", FUSES_LOW
;#	.message "===== Lockbits ======"
;#	.message " LOCKBIT	", LOCKBITS_LOCKBIT
;#	.message "====================="
;#	
;#	.org 0x0000
;#	; Interrupt vectors begin
;#		rjmp	RESET_ISR	; RESET		 - External Reset, Power-on Reset and Watchdog Reset
;#		rjmp	INT0_ISR	; INT0		 - External Interrupt Request 0
;#		reti			; INT1		 - External Interrupt Request 1
;#		reti			; TIMER1_CAPT	 - Timer/Counter1 Capture Event
;#		reti			; TIMER1_COMPA	 - Timer/Counter1 Compare Match A
;#		reti			; TIMER1_OVF	 - Timer/Counter1 Overflow
;#		reti			; TIMER0_OVF	 - Timer/Counter0 Overflow
;#		reti			; USART_RX	 - USART, Rx Complete
;#		reti			; USART_UDRE	 - USART Data Register Empty
;#		reti			; USART_TX	 - USART, Tx Complete
;#		reti			; ANA_COMP	 - Analog Comparator
;#		reti			; PCINT_B	 - Pin Change Interrupt Request B
;#		reti			; TIMER1_COMPB	 - 
;#		reti			; TIMER0_COMPA	 - 
;#		reti			; TIMER0_COMPB	 - 
;#		reti			; USI_START	 - USI Start Condition
;#		reti			; USI_OVERFLOW	 - USI Overflow
;#		reti			; EEPROM_Ready	 - 
;#		reti			; WDT_OVERFLOW	 - Watchdog Timer Overflow
;#		reti			; PCINT_A	 - Pin Change Interrupt Request A
;#		reti			; PCINT_D	 - Pin Change Interrupt Request D
;#	; Interrupt vectors end
;#	;.org INT_VECTORS_SIZE
;#	RESET_ISR:
;#		cli
;#		ldi	r16, high(ADDR_IRAM_END)
;#		out	SP+1, r16
;#		ldi	r16, low(ADDR_IRAM_END)
;#		out	SP, r16
; ----------	 >>>   SKELETON  END    <<<	------------------------

#endif /* _ATTINY4313_INC_ */

; ************************ END OF FILE *********************************

